@extends('layouts.app')

@section('title')
    homework
@endsection

@section('content')
    <h1>Мое домашнє завдання</h1>
    <h3>Лекція 15. Аутентицікація/Авторизація</h3>
    <h4>Аутентицікація</h4>
    <ol>
        <li>Відповідно до вивченої теорії створіть авторизацію та реєстрацію на вашому сайті.</li>
    </ol>
    <h4>Авторизація</h4>
    <ol>
        <li>Використовуючи політики, обмежити доступ до функціоналу адмін панелі для простих користувачів.</li>
    </ol>
    <h4>Підтвердження адреси електронної пошти</h4>
    <ol>
        <li>Реалізуйте функціонал підтвердження електронної пошти.</li>
    </ol>
    <h4>Скид пароля</h4>
    <ol>
        <li>Реалізуйте функціонал відновлення пароля.</li>
    </ol>
@endsection