@extends('layouts.app')

@section('title')
    homework
@endsection

@section('content')
    <h1>Мое домашнє завдання</h1>
    <h3>Лекція 7. Будівельник запитів</h3>
    <ol>
        <li>Підключіть фасад DB до контролера користувачів.</a></li>
        <li>
            <a href={{route('user.query', ['id' => 1])}}>
                Отримайте всі записи з таблиці users та виведіть їх у поданні у вигляді HTML таблиці.
            </a>
        </li>
        <li>Визначте, за який час було виконано наведений запит.</li>
        <li>
            <a href={{route('user.query', ['id' => 2])}}>
                При отриманні даних з таблиці з користувачами залиште у вибірці лише поля name та email.
            </a>
        </li>
        <li>
            <a href={{route('user.query', ['id' => 3])}}>
                При отриманні даних із таблиці з користувачами перейменуйте поле email на user_email.
            </a>
        </li>
        <li>Отримайте всіх користувачів із віком (
            <a href={{route('user.query', ['id' => 4])}}>рівним,</a>
            <a href={{route('user.query', ['id' => 5])}}> не рівним,</a>
            <a href={{route('user.query', ['id' => 6])}}> більшим,</a>
            <a href={{route('user.query', ['id' => 7])}}> меншим,</a>
            <a href={{route('user.query', ['id' => 8])}}>меншим або рівним</a>
             ) 30 років
        </li>
       
        <li>
            <a href={{route('user.query', ['id' => 9])}}>
                Отримайте всіх користувачів з віком від 20 до 30 років.
            </a>
        </li>
        <li>
            <a href={{route('user.query', ['id' => 10])}}>
                Отримайте всіх користувачів з віком 30, або зарплатою 500, або id, більшим за 4.
            </a>
        </li>
        <li>
            <a href={{route('user.query', ['id' => 11])}}>
                Отримайте користувачів, які мають вік від 20 до 30, чи зарплата від 400 до 800.
            </a>
        </li>
        <li>
            <a href={{route('user.query', ['id' => 12])}}>
                Отримайте користувачів, вік яких перебуває НЕ проміжку від 30 до 40 та відсортуйте їх за зменшенням зарплати.
            </a>
        </li>
        <li>
            <a href={{route('user.query', ['id' => 13])}}>
                Отримайте колекцію імен всіх користувачів.
            </a>
        </li>
        <li>
            <a href={{route('user.query', ['id' => 14])}}>
                Отримайте всіх користувачів, відсортованих у випадковому порядку.
            </a>
        </li>
        <li>
            <a href={{route('user.query', ['id' => 15])}}>
                Отримайте одного випадкового користувача.
            </a>
        </li>
        <li>
            <a href={{route('user.query', ['id' => 16])}}>
                Отримайте перших 3 користувача з віком, рівним 30.
            </a>
        </li>
        <li>
            <a href={{route('user.query', ['id' => 17])}}>
                Отримайте 10 користувачів із віком 30, починаючи з третього.
            </a>
        </li>
    </ol>
@endsection