<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Messages Language Lines
    |--------------------------------------------------------------------------
    |
    */

    'show-dashboard' => 'Вибачте, Ви не маєте доступу до адмін.панелі.',
    'policy-post-viewAny' => 'На жаль, ви не маєте доступу до перегляду публікацій.',
    'policy-post-view' => 'На жаль, ви не маєте доступу до перегляду цієї публікацій.',
    'policy-post-update' => 'На жаль, ви не маєте доступу для оновлення цієї публікацій.',
    'policy-post-delete' => 'На жаль, ви не маєте доступу для видалення цієї публікацій.',
    'policy-post-create' => 'На жаль, ви не маєте доступу для створення публікацій.',
    'policy-post-restore' => 'На жаль, ви не маєте доступу до відновлення публікацій.',
    
];
